#### DuctFittingAndAccessoryPressureDropUIDataItem Members

---

|  |
| --- |
| DuctFittingAndAccessoryPressureDropUIDataItem Class   Methods   Properties   See Also |

The  DuctFittingAndAccessoryPressureDropUIDataItem  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  DuctFittingAndAccessoryPressureDropUIDataItem |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetDuctFittingAndAccessoryData | Gets the fitting data stored in the UI data item. |
| Public method | GetEntity | Returns the entity set by UI server. or an invalid entity otherwise. |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | SetEntity | Stores the entity in the UI data item. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

DuctFittingAndAccessoryPressureDropUIDataItem Class

Autodesk.Revit.UI.Mechanical Namespace